homework3/WhatsTheAirportCA/test/TestCaseSecondFault/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wtac="http://j2ee.netbeans.org/wsdl/WhatsTheAirport/src/WTAClientWSDL">
  <soapenv:Body>
    <wtac:WTAClientWSDLOperation>
      <airportCode>SPY</airportCode>
    </wtac:WTAClientWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>